Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
/*
; RP2350_otp_data.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_otp_data equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// OTP_DATA address definitions
// ----------------------------

typedef struct {
    volatile    uint16_t    CHIPID0;
    volatile    uint16_t    CHIPID1;
    volatile    uint16_t    CHIPID2;
    volatile    uint16_t    CHIPID3;
    volatile    uint16_t    RANDID0;
    volatile    uint16_t    RANDID1;
    volatile    uint16_t    RANDID2;
    volatile    uint16_t    RANDID3;
    volatile    uint16_t    RANDID4;
    volatile    uint16_t    RANDID5;
    volatile    uint16_t    RANDID6;
    volatile    uint16_t    RANDID7;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint16_t    ROSC_CALIB;
    volatile    uint16_t    LPOSC_CALIB;
    volatile    uint32_t    RESERVED1[3];
    volatile    uint16_t    NUM_GPIOS;
    volatile    uint16_t    RESERVED2[29];
    volatile    uint16_t    INFO_CRC0;
    volatile    uint16_t    INFO_CRC1;
    volatile    uint32_t    RESERVED3[14];
    volatile    uint16_t    FLASH_DEVINFO;
    volatile    uint16_t    FLASH_PARTITION_SLOT_SIZE;
    volatile    uint16_t    BOOTSEL_LED_CFG;
    volatile    uint16_t    BOOTSEL_PLL_CFG;
    volatile    uint16_t    BOOTSEL_XOSC_CFG;
    volatile    uint16_t    RESERVED4[3];
    volatile    uint16_t    USB_WHITE_LABEL_ADDR;
    volatile    uint16_t    RESERVED5;
    volatile    uint16_t    OTPBOOT_SRC;
    volatile    uint16_t    OTPBOOT_LEN;
    volatile    uint16_t    OTPBOOT_DST0;
    volatile    uint16_t    OTPBOOT_DST1;
    volatile    uint32_t    RESERVED6[15];
    volatile    uint16_t    BOOTKEY0_0;
    volatile    uint16_t    BOOTKEY0_1;
    volatile    uint16_t    BOOTKEY0_2;
    volatile    uint16_t    BOOTKEY0_3;
    volatile    uint16_t    BOOTKEY0_4;
    volatile    uint16_t    BOOTKEY0_5;
    volatile    uint16_t    BOOTKEY0_6;
    volatile    uint16_t    BOOTKEY0_7;
    volatile    uint16_t    BOOTKEY0_8;
    volatile    uint16_t    BOOTKEY0_9;
    volatile    uint16_t    BOOTKEY0_10;
    volatile    uint16_t    BOOTKEY0_11;
    volatile    uint16_t    BOOTKEY0_12;
    volatile    uint16_t    BOOTKEY0_13;
    volatile    uint16_t    BOOTKEY0_14;
    volatile    uint16_t    BOOTKEY0_15;
    volatile    uint16_t    BOOTKEY1_0;
    volatile    uint16_t    BOOTKEY1_1;
    volatile    uint16_t    BOOTKEY1_2;
    volatile    uint16_t    BOOTKEY1_3;
    volatile    uint16_t    BOOTKEY1_4;
    volatile    uint16_t    BOOTKEY1_5;
    volatile    uint16_t    BOOTKEY1_6;
    volatile    uint16_t    BOOTKEY1_7;
    volatile    uint16_t    BOOTKEY1_8;
    volatile    uint16_t    BOOTKEY1_9;
    volatile    uint16_t    BOOTKEY1_10;
    volatile    uint16_t    BOOTKEY1_11;
    volatile    uint16_t    BOOTKEY1_12;
    volatile    uint16_t    BOOTKEY1_13;
    volatile    uint16_t    BOOTKEY1_14;
    volatile    uint16_t    BOOTKEY1_15;
    volatile    uint16_t    BOOTKEY2_0;
    volatile    uint16_t    BOOTKEY2_1;
    volatile    uint16_t    BOOTKEY2_2;
    volatile    uint16_t    BOOTKEY2_3;
    volatile    uint16_t    BOOTKEY2_4;
    volatile    uint16_t    BOOTKEY2_5;
    volatile    uint16_t    BOOTKEY2_6;
    volatile    uint16_t    BOOTKEY2_7;
    volatile    uint16_t    BOOTKEY2_8;
    volatile    uint16_t    BOOTKEY2_9;
    volatile    uint16_t    BOOTKEY2_10;
    volatile    uint16_t    BOOTKEY2_11;
    volatile    uint16_t    BOOTKEY2_12;
    volatile    uint16_t    BOOTKEY2_13;
    volatile    uint16_t    BOOTKEY2_14;
    volatile    uint16_t    BOOTKEY2_15;
    volatile    uint16_t    BOOTKEY3_0;
    volatile    uint16_t    BOOTKEY3_1;
    volatile    uint16_t    BOOTKEY3_2;
    volatile    uint16_t    BOOTKEY3_3;
    volatile    uint16_t    BOOTKEY3_4;
    volatile    uint16_t    BOOTKEY3_5;
    volatile    uint16_t    BOOTKEY3_6;
    volatile    uint16_t    BOOTKEY3_7;
    volatile    uint16_t    BOOTKEY3_8;
    volatile    uint16_t    BOOTKEY3_9;
    volatile    uint16_t    BOOTKEY3_10;
    volatile    uint16_t    BOOTKEY3_11;
    volatile    uint16_t    BOOTKEY3_12;
    volatile    uint16_t    BOOTKEY3_13;
    volatile    uint16_t    BOOTKEY3_14;
    volatile    uint16_t    BOOTKEY3_15;
    volatile    uint32_t    RESERVED7[1860];
    volatile    uint16_t    KEY1_0;
    volatile    uint16_t    KEY1_1;
    volatile    uint16_t    KEY1_2;
    volatile    uint16_t    KEY1_3;
    volatile    uint16_t    KEY1_4;
    volatile    uint16_t    KEY1_5;
    volatile    uint16_t    KEY1_6;
    volatile    uint16_t    KEY1_7;
    volatile    uint16_t    KEY2_0;
    volatile    uint16_t    KEY2_1;
    volatile    uint16_t    KEY2_2;
    volatile    uint16_t    KEY2_3;
    volatile    uint16_t    KEY2_4;
    volatile    uint16_t    KEY2_5;
    volatile    uint16_t    KEY2_6;
    volatile    uint16_t    KEY2_7;
    volatile    uint16_t    KEY3_0;
    volatile    uint16_t    KEY3_1;
    volatile    uint16_t    KEY3_2;
    volatile    uint16_t    KEY3_3;
    volatile    uint16_t    KEY3_4;
    volatile    uint16_t    KEY3_5;
    volatile    uint16_t    KEY3_6;
    volatile    uint16_t    KEY3_7;
    volatile    uint16_t    KEY4_0;
    volatile    uint16_t    KEY4_1;
    volatile    uint16_t    KEY4_2;
    volatile    uint16_t    KEY4_3;
    volatile    uint16_t    KEY4_4;
    volatile    uint16_t    KEY4_5;
    volatile    uint16_t    KEY4_6;
    volatile    uint16_t    KEY4_7;
    volatile    uint16_t    KEY5_0;
    volatile    uint16_t    KEY5_1;
    volatile    uint16_t    KEY5_2;
    volatile    uint16_t    KEY5_3;
    volatile    uint16_t    KEY5_4;
    volatile    uint16_t    KEY5_5;
    volatile    uint16_t    KEY5_6;
    volatile    uint16_t    KEY5_7;
    volatile    uint16_t    KEY6_0;
    volatile    uint16_t    KEY6_1;
    volatile    uint16_t    KEY6_2;
    volatile    uint16_t    KEY6_3;
    volatile    uint16_t    KEY6_4;
    volatile    uint16_t    KEY6_5;
    volatile    uint16_t    KEY6_6;
    volatile    uint16_t    KEY6_7;
} OTP_DATA_TypeDef;

#ifdef __cplusplus
#define OTP_DATA_NS reinterpret_cast<OTP_DATA_TypeDef *>(0x40130000u)
#define OTP_DATA_S  reinterpret_cast<OTP_DATA_TypeDef *>(0x40130000u)
#else
#define OTP_DATA_NS ((OTP_DATA_TypeDef *)0x40130000u)
#define OTP_DATA_S  ((OTP_DATA_TypeDef *)0x40130000u)
#endif

// CHIPID0 Configuration

#define OTP_DATA_CHIPID0_CHIPID0                                                                            (0xFFFFu<<0)
#define OTP_DATA_CHIPID0_CHIPID0_0                                                                          (0x1u<<0)

// CHIPID1 Configuration

#define OTP_DATA_CHIPID1_CHIPID1                                                                            (0xFFFFu<<0)
#define OTP_DATA_CHIPID1_CHIPID1_0                                                                          (0x1u<<0)

// CHIPID2 Configuration

#define OTP_DATA_CHIPID2_CHIPID2                                                                            (0xFFFFu<<0)
#define OTP_DATA_CHIPID2_CHIPID2_0                                                                          (0x1u<<0)

// CHIPID3 Configuration

