Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
#define OTP_DATA_CHIPID3_CHIPID3                                                                            (0xFFFFu<<0)
#define OTP_DATA_CHIPID3_CHIPID3_0                                                                          (0x1u<<0)

// RANDID0 Configuration

#define OTP_DATA_RANDID0_RANDID0                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID0_RANDID0_0                                                                          (0x1u<<0)

// RANDID1 Configuration

#define OTP_DATA_RANDID1_RANDID1                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID1_RANDID1_0                                                                          (0x1u<<0)

// RANDID2 Configuration

#define OTP_DATA_RANDID2_RANDID2                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID2_RANDID2_0                                                                          (0x1u<<0)

// RANDID3 Configuration

#define OTP_DATA_RANDID3_RANDID3                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID3_RANDID3_0                                                                          (0x1u<<0)

// RANDID4 Configuration

#define OTP_DATA_RANDID4_RANDID4                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID4_RANDID4_0                                                                          (0x1u<<0)

// RANDID5 Configuration

#define OTP_DATA_RANDID5_RANDID5                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID5_RANDID5_0                                                                          (0x1u<<0)

// RANDID6 Configuration

#define OTP_DATA_RANDID6_RANDID6                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID6_RANDID6_0                                                                          (0x1u<<0)

// RANDID7 Configuration

#define OTP_DATA_RANDID7_RANDID7                                                                            (0xFFFFu<<0)
#define OTP_DATA_RANDID7_RANDID7_0                                                                          (0x1u<<0)

// ROSC_CALIB Configuration

#define OTP_DATA_ROSC_CALIB_ROSC_CALIB                                                                      (0xFFFFu<<0)
#define OTP_DATA_ROSC_CALIB_ROSC_CALIB_0                                                                    (0x1u<<0)

// LPOSC_CALIB Configuration

#define OTP_DATA_LPOSC_CALIB_LPOSC_CALIB                                                                    (0xFFFFu<<0)
#define OTP_DATA_LPOSC_CALIB_LPOSC_CALIB_0                                                                  (0x1u<<0)

// NUM_GPIOS Configuration

#define OTP_DATA_NUM_GPIOS_NUM_GPIOS                                                                        (0xFFu<<0)
#define OTP_DATA_NUM_GPIOS_NUM_GPIOS_0                                                                      (0x1u<<0)

// INFO_CRC0 Configuration

#define OTP_DATA_INFO_CRC0_INFO_CRC0                                                                        (0xFFFFu<<0)
#define OTP_DATA_INFO_CRC0_INFO_CRC0_0                                                                      (0x1u<<0)

// INFO_CRC1 Configuration

#define OTP_DATA_INFO_CRC1_INFO_CRC1                                                                        (0xFFFFu<<0)
#define OTP_DATA_INFO_CRC1_INFO_CRC1_0                                                                      (0x1u<<0)

// FLASH_DEVINFO Configuration

#define OTP_DATA_FLASH_DEVINFO_CS1_GPIO                                                                     (0x3Fu<<0)
#define OTP_DATA_FLASH_DEVINFO_CS1_GPIO_0                                                                   (0x1u<<0)
#define OTP_DATA_FLASH_DEVINFO_D8H_ERASE_SUPPORTED                                                          (0x1u<<7)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE                                                                     (0xFu<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_0                                                                   (0x1u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE                                                                     (0xFu<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_0                                                                   (0x1u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_NONE                                                                (0x0u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_8K                                                                  (0x1u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_16K                                                                 (0x2u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_32K                                                                 (0x3u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_64K                                                                 (0x4u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_128K                                                                (0x5u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_256K                                                                (0x6u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_512K                                                                (0x7u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_1M                                                                  (0x8u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_2M                                                                  (0x9u<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_4M                                                                  (0xAu<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_8M                                                                  (0xBu<<8)
#define OTP_DATA_FLASH_DEVINFO_CS0_SIZE_16M                                                                 (0xCu<<8)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_NONE                                                                (0x0u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_8K                                                                  (0x1u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_16K                                                                 (0x2u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_32K                                                                 (0x3u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_64K                                                                 (0x4u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_128K                                                                (0x5u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_256K                                                                (0x6u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_512K                                                                (0x7u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_1M                                                                  (0x8u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_2M                                                                  (0x9u<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_4M                                                                  (0xAu<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_8M                                                                  (0xBu<<12)
#define OTP_DATA_FLASH_DEVINFO_CS1_SIZE_16M                                                                 (0xCu<<12)

// FLASH_PARTITION_SLOT_SIZE Configuration

