Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
#define OTP_DATA_FLASH_PARTITION_SLOT_SIZE_FLASH_PARTITION_SLOT_SIZE                                        (0xFFFFu<<0)
#define OTP_DATA_FLASH_PARTITION_SLOT_SIZE_FLASH_PARTITION_SLOT_SIZE_0                                      (0x1u<<0)

// BOOTSEL_LED_CFG Configuration

#define OTP_DATA_BOOTSEL_LED_CFG_PIN                                                                        (0x3Fu<<0)
#define OTP_DATA_BOOTSEL_LED_CFG_PIN_0                                                                      (0x1u<<0)
#define OTP_DATA_BOOTSEL_LED_CFG_ACTIVELOW                                                                  (0x1u<<8)

// BOOTSEL_PLL_CFG Configuration

#define OTP_DATA_BOOTSEL_PLL_CFG_FBDIV                                                                      (0x1FFu<<0)
#define OTP_DATA_BOOTSEL_PLL_CFG_FBDIV_0                                                                    (0x1u<<0)
#define OTP_DATA_BOOTSEL_PLL_CFG_POSTDIV1                                                                   (0x7u<<9)
#define OTP_DATA_BOOTSEL_PLL_CFG_POSTDIV1_0                                                                 (0x1u<<9)
#define OTP_DATA_BOOTSEL_PLL_CFG_POSTDIV2                                                                   (0x7u<<12)
#define OTP_DATA_BOOTSEL_PLL_CFG_POSTDIV2_0                                                                 (0x1u<<12)
#define OTP_DATA_BOOTSEL_PLL_CFG_REFDIV                                                                     (0x1u<<15)

// BOOTSEL_XOSC_CFG Configuration

#define OTP_DATA_BOOTSEL_XOSC_CFG_STARTUP                                                                   (0x3FFFu<<0)
#define OTP_DATA_BOOTSEL_XOSC_CFG_STARTUP_0                                                                 (0x1u<<0)
#define OTP_DATA_BOOTSEL_XOSC_CFG_RANGE                                                                     (0x3u<<14)
#define OTP_DATA_BOOTSEL_XOSC_CFG_RANGE_0                                                                   (0x1u<<14)
#define OTP_DATA_BOOTSEL_XOSC_CFG_RANGE_1_15MHZ                                                             (0x0u<<14)
#define OTP_DATA_BOOTSEL_XOSC_CFG_RANGE_10_30MHZ                                                            (0x1u<<14)
#define OTP_DATA_BOOTSEL_XOSC_CFG_RANGE_25_60MHZ                                                            (0x2u<<14)
#define OTP_DATA_BOOTSEL_XOSC_CFG_RANGE_40_100MHZ                                                           (0x3u<<14)

// USB_WHITE_LABEL_ADDR Configuration

#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR                                                  (0xFFFFu<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_0                                                (0x1u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_VID_VALUE                       (0x0u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_PID_VALUE                       (0x1u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_BCD_DEVICE_VALUE                (0x2u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_LANG_ID_VALUE                   (0x3u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_MANUFACTURER_STRDEF             (0x4u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_PRODUCT_STRDEF                  (0x5u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_SERIAL_NUMBER_STRDEF            (0x6u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES     (0x7u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_VOLUME_LABEL_STRDEF                        (0x8u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_SCSI_INQUIRY_VENDOR_STRDEF                 (0x9u<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_SCSI_INQUIRY_PRODUCT_STRDEF                (0xAu<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_SCSI_INQUIRY_VERSION_STRDEF                (0xBu<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INDEX_HTM_REDIRECT_URL_STRDEF              (0xCu<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INDEX_HTM_REDIRECT_NAME_STRDEF             (0xDu<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INFO_UF2_TXT_MODEL_STRDEF                  (0xEu<<0)
#define OTP_DATA_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INFO_UF2_TXT_BOARD_ID_STRDEF               (0xFu<<0)

// OTPBOOT_SRC Configuration

#define OTP_DATA_OTPBOOT_SRC_OTPBOOT_SRC                                                                    (0xFFFFu<<0)
#define OTP_DATA_OTPBOOT_SRC_OTPBOOT_SRC_0                                                                  (0x1u<<0)

// OTPBOOT_LEN Configuration

#define OTP_DATA_OTPBOOT_LEN_OTPBOOT_LEN                                                                    (0xFFFFu<<0)
#define OTP_DATA_OTPBOOT_LEN_OTPBOOT_LEN_0                                                                  (0x1u<<0)

// OTPBOOT_DST0 Configuration

#define OTP_DATA_OTPBOOT_DST0_OTPBOOT_DST0                                                                  (0xFFFFu<<0)
#define OTP_DATA_OTPBOOT_DST0_OTPBOOT_DST0_0                                                                (0x1u<<0)

// OTPBOOT_DST1 Configuration

#define OTP_DATA_OTPBOOT_DST1_OTPBOOT_DST1                                                                  (0xFFFFu<<0)
#define OTP_DATA_OTPBOOT_DST1_OTPBOOT_DST1_0                                                                (0x1u<<0)

// BOOTKEY0_0 Configuration

#define OTP_DATA_BOOTKEY0_0_BOOTKEY0_0                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_0_BOOTKEY0_0_0                                                                    (0x1u<<0)

