Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
// BOOTKEY0_1 Configuration

#define OTP_DATA_BOOTKEY0_1_BOOTKEY0_1                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_1_BOOTKEY0_1_0                                                                    (0x1u<<0)

// BOOTKEY0_2 Configuration

#define OTP_DATA_BOOTKEY0_2_BOOTKEY0_2                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_2_BOOTKEY0_2_0                                                                    (0x1u<<0)

// BOOTKEY0_3 Configuration

#define OTP_DATA_BOOTKEY0_3_BOOTKEY0_3                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_3_BOOTKEY0_3_0                                                                    (0x1u<<0)

// BOOTKEY0_4 Configuration

#define OTP_DATA_BOOTKEY0_4_BOOTKEY0_4                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_4_BOOTKEY0_4_0                                                                    (0x1u<<0)

// BOOTKEY0_5 Configuration

#define OTP_DATA_BOOTKEY0_5_BOOTKEY0_5                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_5_BOOTKEY0_5_0                                                                    (0x1u<<0)

// BOOTKEY0_6 Configuration

#define OTP_DATA_BOOTKEY0_6_BOOTKEY0_6                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_6_BOOTKEY0_6_0                                                                    (0x1u<<0)

// BOOTKEY0_7 Configuration

#define OTP_DATA_BOOTKEY0_7_BOOTKEY0_7                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_7_BOOTKEY0_7_0                                                                    (0x1u<<0)

// BOOTKEY0_8 Configuration

#define OTP_DATA_BOOTKEY0_8_BOOTKEY0_8                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_8_BOOTKEY0_8_0                                                                    (0x1u<<0)

// BOOTKEY0_9 Configuration

#define OTP_DATA_BOOTKEY0_9_BOOTKEY0_9                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_9_BOOTKEY0_9_0                                                                    (0x1u<<0)

// BOOTKEY0_10 Configuration

#define OTP_DATA_BOOTKEY0_10_BOOTKEY0_10                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_10_BOOTKEY0_10_0                                                                  (0x1u<<0)

// BOOTKEY0_11 Configuration

#define OTP_DATA_BOOTKEY0_11_BOOTKEY0_11                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_11_BOOTKEY0_11_0                                                                  (0x1u<<0)

// BOOTKEY0_12 Configuration

#define OTP_DATA_BOOTKEY0_12_BOOTKEY0_12                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_12_BOOTKEY0_12_0                                                                  (0x1u<<0)

// BOOTKEY0_13 Configuration

#define OTP_DATA_BOOTKEY0_13_BOOTKEY0_13                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_13_BOOTKEY0_13_0                                                                  (0x1u<<0)

// BOOTKEY0_14 Configuration

#define OTP_DATA_BOOTKEY0_14_BOOTKEY0_14                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_14_BOOTKEY0_14_0                                                                  (0x1u<<0)

// BOOTKEY0_15 Configuration

#define OTP_DATA_BOOTKEY0_15_BOOTKEY0_15                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY0_15_BOOTKEY0_15_0                                                                  (0x1u<<0)

// BOOTKEY1_0 Configuration

#define OTP_DATA_BOOTKEY1_0_BOOTKEY1_0                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_0_BOOTKEY1_0_0                                                                    (0x1u<<0)

// BOOTKEY1_1 Configuration

#define OTP_DATA_BOOTKEY1_1_BOOTKEY1_1                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_1_BOOTKEY1_1_0                                                                    (0x1u<<0)

// BOOTKEY1_2 Configuration

#define OTP_DATA_BOOTKEY1_2_BOOTKEY1_2                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_2_BOOTKEY1_2_0                                                                    (0x1u<<0)

// BOOTKEY1_3 Configuration

#define OTP_DATA_BOOTKEY1_3_BOOTKEY1_3                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_3_BOOTKEY1_3_0                                                                    (0x1u<<0)

// BOOTKEY1_4 Configuration

#define OTP_DATA_BOOTKEY1_4_BOOTKEY1_4                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_4_BOOTKEY1_4_0                                                                    (0x1u<<0)

// BOOTKEY1_5 Configuration

#define OTP_DATA_BOOTKEY1_5_BOOTKEY1_5                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_5_BOOTKEY1_5_0                                                                    (0x1u<<0)

// BOOTKEY1_6 Configuration

#define OTP_DATA_BOOTKEY1_6_BOOTKEY1_6                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_6_BOOTKEY1_6_0                                                                    (0x1u<<0)

// BOOTKEY1_7 Configuration

#define OTP_DATA_BOOTKEY1_7_BOOTKEY1_7                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_7_BOOTKEY1_7_0                                                                    (0x1u<<0)

