Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
// BOOTKEY1_8 Configuration

#define OTP_DATA_BOOTKEY1_8_BOOTKEY1_8                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_8_BOOTKEY1_8_0                                                                    (0x1u<<0)

// BOOTKEY1_9 Configuration

#define OTP_DATA_BOOTKEY1_9_BOOTKEY1_9                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_9_BOOTKEY1_9_0                                                                    (0x1u<<0)

// BOOTKEY1_10 Configuration

#define OTP_DATA_BOOTKEY1_10_BOOTKEY1_10                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_10_BOOTKEY1_10_0                                                                  (0x1u<<0)

// BOOTKEY1_11 Configuration

#define OTP_DATA_BOOTKEY1_11_BOOTKEY1_11                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_11_BOOTKEY1_11_0                                                                  (0x1u<<0)

// BOOTKEY1_12 Configuration

#define OTP_DATA_BOOTKEY1_12_BOOTKEY1_12                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_12_BOOTKEY1_12_0                                                                  (0x1u<<0)

// BOOTKEY1_13 Configuration

#define OTP_DATA_BOOTKEY1_13_BOOTKEY1_13                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_13_BOOTKEY1_13_0                                                                  (0x1u<<0)

// BOOTKEY1_14 Configuration

#define OTP_DATA_BOOTKEY1_14_BOOTKEY1_14                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_14_BOOTKEY1_14_0                                                                  (0x1u<<0)

// BOOTKEY1_15 Configuration

#define OTP_DATA_BOOTKEY1_15_BOOTKEY1_15                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY1_15_BOOTKEY1_15_0                                                                  (0x1u<<0)

// BOOTKEY2_0 Configuration

#define OTP_DATA_BOOTKEY2_0_BOOTKEY2_0                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_0_BOOTKEY2_0_0                                                                    (0x1u<<0)

// BOOTKEY2_1 Configuration

#define OTP_DATA_BOOTKEY2_1_BOOTKEY2_1                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_1_BOOTKEY2_1_0                                                                    (0x1u<<0)

// BOOTKEY2_2 Configuration

#define OTP_DATA_BOOTKEY2_2_BOOTKEY2_2                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_2_BOOTKEY2_2_0                                                                    (0x1u<<0)

// BOOTKEY2_3 Configuration

#define OTP_DATA_BOOTKEY2_3_BOOTKEY2_3                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_3_BOOTKEY2_3_0                                                                    (0x1u<<0)

// BOOTKEY2_4 Configuration

#define OTP_DATA_BOOTKEY2_4_BOOTKEY2_4                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_4_BOOTKEY2_4_0                                                                    (0x1u<<0)

// BOOTKEY2_5 Configuration

#define OTP_DATA_BOOTKEY2_5_BOOTKEY2_5                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_5_BOOTKEY2_5_0                                                                    (0x1u<<0)

// BOOTKEY2_6 Configuration

#define OTP_DATA_BOOTKEY2_6_BOOTKEY2_6                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_6_BOOTKEY2_6_0                                                                    (0x1u<<0)

// BOOTKEY2_7 Configuration

#define OTP_DATA_BOOTKEY2_7_BOOTKEY2_7                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_7_BOOTKEY2_7_0                                                                    (0x1u<<0)

// BOOTKEY2_8 Configuration

#define OTP_DATA_BOOTKEY2_8_BOOTKEY2_8                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_8_BOOTKEY2_8_0                                                                    (0x1u<<0)

// BOOTKEY2_9 Configuration

#define OTP_DATA_BOOTKEY2_9_BOOTKEY2_9                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_9_BOOTKEY2_9_0                                                                    (0x1u<<0)

// BOOTKEY2_10 Configuration

#define OTP_DATA_BOOTKEY2_10_BOOTKEY2_10                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_10_BOOTKEY2_10_0                                                                  (0x1u<<0)

// BOOTKEY2_11 Configuration

#define OTP_DATA_BOOTKEY2_11_BOOTKEY2_11                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_11_BOOTKEY2_11_0                                                                  (0x1u<<0)

// BOOTKEY2_12 Configuration

#define OTP_DATA_BOOTKEY2_12_BOOTKEY2_12                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_12_BOOTKEY2_12_0                                                                  (0x1u<<0)

// BOOTKEY2_13 Configuration

#define OTP_DATA_BOOTKEY2_13_BOOTKEY2_13                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_13_BOOTKEY2_13_0                                                                  (0x1u<<0)

// BOOTKEY2_14 Configuration

#define OTP_DATA_BOOTKEY2_14_BOOTKEY2_14                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_14_BOOTKEY2_14_0                                                                  (0x1u<<0)

// BOOTKEY2_15 Configuration

