Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
#define OTP_DATA_BOOTKEY2_15_BOOTKEY2_15                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY2_15_BOOTKEY2_15_0                                                                  (0x1u<<0)

// BOOTKEY3_0 Configuration

#define OTP_DATA_BOOTKEY3_0_BOOTKEY3_0                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_0_BOOTKEY3_0_0                                                                    (0x1u<<0)

// BOOTKEY3_1 Configuration

#define OTP_DATA_BOOTKEY3_1_BOOTKEY3_1                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_1_BOOTKEY3_1_0                                                                    (0x1u<<0)

// BOOTKEY3_2 Configuration

#define OTP_DATA_BOOTKEY3_2_BOOTKEY3_2                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_2_BOOTKEY3_2_0                                                                    (0x1u<<0)

// BOOTKEY3_3 Configuration

#define OTP_DATA_BOOTKEY3_3_BOOTKEY3_3                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_3_BOOTKEY3_3_0                                                                    (0x1u<<0)

// BOOTKEY3_4 Configuration

#define OTP_DATA_BOOTKEY3_4_BOOTKEY3_4                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_4_BOOTKEY3_4_0                                                                    (0x1u<<0)

// BOOTKEY3_5 Configuration

#define OTP_DATA_BOOTKEY3_5_BOOTKEY3_5                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_5_BOOTKEY3_5_0                                                                    (0x1u<<0)

// BOOTKEY3_6 Configuration

#define OTP_DATA_BOOTKEY3_6_BOOTKEY3_6                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_6_BOOTKEY3_6_0                                                                    (0x1u<<0)

// BOOTKEY3_7 Configuration

#define OTP_DATA_BOOTKEY3_7_BOOTKEY3_7                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_7_BOOTKEY3_7_0                                                                    (0x1u<<0)

// BOOTKEY3_8 Configuration

#define OTP_DATA_BOOTKEY3_8_BOOTKEY3_8                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_8_BOOTKEY3_8_0                                                                    (0x1u<<0)

// BOOTKEY3_9 Configuration

#define OTP_DATA_BOOTKEY3_9_BOOTKEY3_9                                                                      (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_9_BOOTKEY3_9_0                                                                    (0x1u<<0)

// BOOTKEY3_10 Configuration

#define OTP_DATA_BOOTKEY3_10_BOOTKEY3_10                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_10_BOOTKEY3_10_0                                                                  (0x1u<<0)

// BOOTKEY3_11 Configuration

#define OTP_DATA_BOOTKEY3_11_BOOTKEY3_11                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_11_BOOTKEY3_11_0                                                                  (0x1u<<0)

// BOOTKEY3_12 Configuration

#define OTP_DATA_BOOTKEY3_12_BOOTKEY3_12                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_12_BOOTKEY3_12_0                                                                  (0x1u<<0)

// BOOTKEY3_13 Configuration

#define OTP_DATA_BOOTKEY3_13_BOOTKEY3_13                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_13_BOOTKEY3_13_0                                                                  (0x1u<<0)

// BOOTKEY3_14 Configuration

#define OTP_DATA_BOOTKEY3_14_BOOTKEY3_14                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_14_BOOTKEY3_14_0                                                                  (0x1u<<0)

// BOOTKEY3_15 Configuration

#define OTP_DATA_BOOTKEY3_15_BOOTKEY3_15                                                                    (0xFFFFu<<0)
#define OTP_DATA_BOOTKEY3_15_BOOTKEY3_15_0                                                                  (0x1u<<0)

// KEY1_0 Configuration

#define OTP_DATA_KEY1_0_KEY1_0                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_0_KEY1_0_0                                                                            (0x1u<<0)

// KEY1_1 Configuration

#define OTP_DATA_KEY1_1_KEY1_1                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_1_KEY1_1_0                                                                            (0x1u<<0)

// KEY1_2 Configuration

#define OTP_DATA_KEY1_2_KEY1_2                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_2_KEY1_2_0                                                                            (0x1u<<0)

// KEY1_3 Configuration

#define OTP_DATA_KEY1_3_KEY1_3                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_3_KEY1_3_0                                                                            (0x1u<<0)

// KEY1_4 Configuration

#define OTP_DATA_KEY1_4_KEY1_4                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_4_KEY1_4_0                                                                            (0x1u<<0)

// KEY1_5 Configuration

#define OTP_DATA_KEY1_5_KEY1_5                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_5_KEY1_5_0                                                                            (0x1u<<0)

// KEY1_6 Configuration

#define OTP_DATA_KEY1_6_KEY1_6                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_6_KEY1_6_0                                                                            (0x1u<<0)

// KEY1_7 Configuration

