Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
#define OTP_DATA_KEY1_7_KEY1_7                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY1_7_KEY1_7_0                                                                            (0x1u<<0)

// KEY2_0 Configuration

#define OTP_DATA_KEY2_0_KEY2_0                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_0_KEY2_0_0                                                                            (0x1u<<0)

// KEY2_1 Configuration

#define OTP_DATA_KEY2_1_KEY2_1                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_1_KEY2_1_0                                                                            (0x1u<<0)

// KEY2_2 Configuration

#define OTP_DATA_KEY2_2_KEY2_2                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_2_KEY2_2_0                                                                            (0x1u<<0)

// KEY2_3 Configuration

#define OTP_DATA_KEY2_3_KEY2_3                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_3_KEY2_3_0                                                                            (0x1u<<0)

// KEY2_4 Configuration

#define OTP_DATA_KEY2_4_KEY2_4                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_4_KEY2_4_0                                                                            (0x1u<<0)

// KEY2_5 Configuration

#define OTP_DATA_KEY2_5_KEY2_5                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_5_KEY2_5_0                                                                            (0x1u<<0)

// KEY2_6 Configuration

#define OTP_DATA_KEY2_6_KEY2_6                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_6_KEY2_6_0                                                                            (0x1u<<0)

// KEY2_7 Configuration

#define OTP_DATA_KEY2_7_KEY2_7                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY2_7_KEY2_7_0                                                                            (0x1u<<0)

// KEY3_0 Configuration

#define OTP_DATA_KEY3_0_KEY3_0                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_0_KEY3_0_0                                                                            (0x1u<<0)

// KEY3_1 Configuration

#define OTP_DATA_KEY3_1_KEY3_1                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_1_KEY3_1_0                                                                            (0x1u<<0)

// KEY3_2 Configuration

#define OTP_DATA_KEY3_2_KEY3_2                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_2_KEY3_2_0                                                                            (0x1u<<0)

// KEY3_3 Configuration

#define OTP_DATA_KEY3_3_KEY3_3                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_3_KEY3_3_0                                                                            (0x1u<<0)

// KEY3_4 Configuration

#define OTP_DATA_KEY3_4_KEY3_4                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_4_KEY3_4_0                                                                            (0x1u<<0)

// KEY3_5 Configuration

#define OTP_DATA_KEY3_5_KEY3_5                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_5_KEY3_5_0                                                                            (0x1u<<0)

// KEY3_6 Configuration

#define OTP_DATA_KEY3_6_KEY3_6                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_6_KEY3_6_0                                                                            (0x1u<<0)

// KEY3_7 Configuration

#define OTP_DATA_KEY3_7_KEY3_7                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY3_7_KEY3_7_0                                                                            (0x1u<<0)

// KEY4_0 Configuration

#define OTP_DATA_KEY4_0_KEY4_0                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_0_KEY4_0_0                                                                            (0x1u<<0)

// KEY4_1 Configuration

#define OTP_DATA_KEY4_1_KEY4_1                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_1_KEY4_1_0                                                                            (0x1u<<0)

// KEY4_2 Configuration

#define OTP_DATA_KEY4_2_KEY4_2                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_2_KEY4_2_0                                                                            (0x1u<<0)

// KEY4_3 Configuration

#define OTP_DATA_KEY4_3_KEY4_3                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_3_KEY4_3_0                                                                            (0x1u<<0)

// KEY4_4 Configuration

#define OTP_DATA_KEY4_4_KEY4_4                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_4_KEY4_4_0                                                                            (0x1u<<0)

// KEY4_5 Configuration

#define OTP_DATA_KEY4_5_KEY4_5                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_5_KEY4_5_0                                                                            (0x1u<<0)

// KEY4_6 Configuration

#define OTP_DATA_KEY4_6_KEY4_6                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_6_KEY4_6_0                                                                            (0x1u<<0)

// KEY4_7 Configuration

