Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_otp_data.h
#define OTP_DATA_KEY4_7_KEY4_7                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY4_7_KEY4_7_0                                                                            (0x1u<<0)

// KEY5_0 Configuration

#define OTP_DATA_KEY5_0_KEY5_0                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_0_KEY5_0_0                                                                            (0x1u<<0)

// KEY5_1 Configuration

#define OTP_DATA_KEY5_1_KEY5_1                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_1_KEY5_1_0                                                                            (0x1u<<0)

// KEY5_2 Configuration

#define OTP_DATA_KEY5_2_KEY5_2                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_2_KEY5_2_0                                                                            (0x1u<<0)

// KEY5_3 Configuration

#define OTP_DATA_KEY5_3_KEY5_3                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_3_KEY5_3_0                                                                            (0x1u<<0)

// KEY5_4 Configuration

#define OTP_DATA_KEY5_4_KEY5_4                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_4_KEY5_4_0                                                                            (0x1u<<0)

// KEY5_5 Configuration

#define OTP_DATA_KEY5_5_KEY5_5                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_5_KEY5_5_0                                                                            (0x1u<<0)

// KEY5_6 Configuration

#define OTP_DATA_KEY5_6_KEY5_6                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_6_KEY5_6_0                                                                            (0x1u<<0)

// KEY5_7 Configuration

#define OTP_DATA_KEY5_7_KEY5_7                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY5_7_KEY5_7_0                                                                            (0x1u<<0)

// KEY6_0 Configuration

#define OTP_DATA_KEY6_0_KEY6_0                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_0_KEY6_0_0                                                                            (0x1u<<0)

// KEY6_1 Configuration

#define OTP_DATA_KEY6_1_KEY6_1                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_1_KEY6_1_0                                                                            (0x1u<<0)

// KEY6_2 Configuration

#define OTP_DATA_KEY6_2_KEY6_2                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_2_KEY6_2_0                                                                            (0x1u<<0)

// KEY6_3 Configuration

#define OTP_DATA_KEY6_3_KEY6_3                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_3_KEY6_3_0                                                                            (0x1u<<0)

// KEY6_4 Configuration

#define OTP_DATA_KEY6_4_KEY6_4                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_4_KEY6_4_0                                                                            (0x1u<<0)

// KEY6_5 Configuration

#define OTP_DATA_KEY6_5_KEY6_5                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_5_KEY6_5_0                                                                            (0x1u<<0)

// KEY6_6 Configuration

#define OTP_DATA_KEY6_6_KEY6_6                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_6_KEY6_6_0                                                                            (0x1u<<0)

// KEY6_7 Configuration

#define OTP_DATA_KEY6_7_KEY6_7                                                                              (0xFFFFu<<0)
#define OTP_DATA_KEY6_7_KEY6_7_0                                                                            (0x1u<<0)
